# Python Assignment – Pandas

## 1.  Define and create a Dataframe using Pandas.

In [86]:
import pandas as pd
import numpy as np

In [17]:
data={'Name': ['Rathna','Bhanu','Ravi','Divya','Shami','Shuba','Deepu','Manju','Niranjan','Ramesh'],
          'Age': [56,38,28,22,24,30,43,33,30,67], 
      'Covid+' : [0,1,0,0,1,0,0,1,0,0], 
    'Vaccinated' : ['y','y','n','y','n','n','n','y','n','y']}

In [18]:
df = pd.DataFrame(data)

In [19]:
df

       Name  Age  Covid+ Vaccinated
0    Rathna   56       0          y
1     Bhanu   38       1          y
2      Ravi   28       0          n
3     Divya   22       0          y
4     Shami   24       1          n
5     Shuba   30       0          n
6     Deepu   43       0          n
7     Manju   33       1          y
8  Niranjan   30       0          n
9    Ramesh   67       0          y

## 2. How can we calculate the standard deviation from the series.

In [20]:
ser1 = pd.Series([1,2,3,4], index = ['a','b','c','d'])
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [23]:
# standard devidation
ser1.std()

1.2909944487358056

## 3. . Create a Dataframe using List given below:
- lis=[‘Python’,’Numpy’,’Pandas’]

In [28]:
lis = ['Python','Numpy','Pandas']
df2 = pd.DataFrame(lis)
df2

        0
0  Python
1   Numpy
2  Pandas

## 4.  Create a Series from dictionary given below:
 - info = {'x' : 0., 'y' : 1., 'z' : 2.}

In [29]:
info = {'x' : 0., 'y' : 1., 'z' : 2.}
ser2 = pd.Series(info)
ser2

x    0.0
y    1.0
z    2.0
dtype: float64

## 5. How will you create an empty Dataframe in Pandas?

In [46]:
df3 = pd.DataFrame()
df3

Empty DataFrame
Columns: []
Index: []

### 6. i) Add a column to that pandas Dataframe that you created in Q1
###    ii) Change index of that Dataframe.

In [49]:
# adding a emply column
df3['NewCol']= ['A','B','C']

In [50]:
df3

  NewCol
0      A
1      B
2      C

In [51]:
df3.set_index('NewCol')

Empty DataFrame
Columns: []
Index: [A, B, C]

## 7. . Get the following from this dataframe:
### import random
### A = [ random.randint(0,100) for i in range(10) ]
### B = [ random.randint(0,100) for i in range(10) ]
### df = pd.DataFrame({ 'field_A': A, 'field_B': B })
### i) mean
### ii) median
### iii) mode
### iv) 75th percentile
### v) 90th percentile
### vi) 99th percentile

In [54]:
import random
A = [ random.randint(0,100) for i in range(10) ]
B = [ random.randint(0,100) for i in range(10) ]
df = pd.DataFrame({ 'field_A': A, 'field_B': B })

In [55]:
df

   field_A  field_B
0       34       22
1       69        9
2       67       96
3       67       35
4       93       94
5       39        4
6       39       96
7       39        8
8       23       95
9       64       36

In [58]:
df.mean()

field_A    53.4
field_B    49.5
dtype: float64

In [59]:
df.median()

field_A    51.5
field_B    35.5
dtype: float64

In [60]:
df.mode()

   field_A  field_B
0       39       96

In [64]:
df.quantile(.75)

field_A    67.00
field_B    94.75
Name: 0.75, dtype: float64

In [65]:
df.quantile(.90)

field_A    71.4
field_B    96.0
Name: 0.9, dtype: float64

In [66]:
df.quantile(.99)

field_A    90.84
field_B    96.00
Name: 0.99, dtype: float64

## 8. How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

In [79]:
random.seed(42)
A = ['cat','cat','turtle','dog','dog','cat','turtle','cat','dog','dog']
B = [ random.randint(0,100) for i in range(10) ]
df = pd.DataFrame({ 'field_A': A, 'field_B': B })
df

  field_A  field_B
0     cat       81
1     cat       14
2  turtle        3
3     dog       94
4     dog       35
5     cat       31
6  turtle       28
7     cat       17
8     dog       94
9     dog       13

In [83]:
df.nunique()

field_A    3
field_B    9
dtype: int64

## 9.  How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’? Take the following as input.
- np.random.RandomState(100)
- ser = pd.Series(np.random.randint(1, 5, [12]))

In [114]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

In [115]:
# the series
ser

0     3
1     3
2     1
3     4
4     1
5     1
6     4
7     1
8     3
9     3
10    2
11    1
dtype: int32

In [116]:
# frequency of values
ser.value_counts()

1    5
3    4
4    2
2    1
dtype: int64

In [117]:
#index of top two most frequent values
s = ser.value_counts().index[:2]

In [118]:
s

Int64Index([1, 3], dtype='int64')

In [119]:
# updating the series with 'Other'
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'

In [120]:
ser

0         3
1         3
2         1
3     Other
4         1
5         1
6     Other
7         1
8         3
9         3
10    Other
11        1
dtype: object

## 10.  A DataFrame has a column of groups 'grps' and and column of 
 - integer values 'vals':
 - df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 'vals': [12, 345, 3, 1, 45, 14 , 4, 52, 54, 23, 235,21, 57, 3, 87]})
 
 - For each group, find the sum of the three greatest values. You should end up with the answer as follows:
    - grps
    - a 409
    - b 156
    - c 345  - > these calulation seems to be wrong, please check the answers.

In [139]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 'vals': [12, 345, 3, 1, 45, 14 , 4, 52, 54, 23, 235,21, 57, 3, 87]})

In [140]:
df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [145]:
df.groupby('grps').sum()

      vals
grps
a      416
b      160
c      380

## * Create a dataframe for the following to answer the next few questions
    - data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    - 'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    - 'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    - 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
    -  labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [256]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df_1 = pd.DataFrame(data, index = labels)

In [257]:
df_1

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

## 11.  Display a summary of the basic information about this DataFrame and its data (hint: there is a single method that can be called on the DataFrame).

In [258]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [259]:
df_1.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

## 12.  Select the rows where the age is between 2 and 4 (inclusive).

In [260]:
df_1.loc[(df_1['age'] >=2 ) & (df_1['age'] <=4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

## 13. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [261]:
df_1.iloc[[3,4,8],[0,1]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

## 14.  Select the rows where the age is missing, i.e. it is NaN.

In [262]:
df_1.loc[df_1['age'].isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

## 15. Select the rows where the animal is a cat and the age is less than 3.

In [263]:
df_1.loc[(df_1['age'] < 3 ) & (df_1['animal'] == 'cat')]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

 ## 16. Change the age in row 'f' to 1.5.

In [264]:
animal = df_1.copy()

In [265]:
animal

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [266]:
animal.loc['f','age'] = 1.5

In [267]:
animal

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

## 17. In the 'animal' column, change the 'snake' entries to 'python'

In [268]:
df_1.loc[(df_1.animal == 'snake'),'animal'] = 'python'

In [269]:
df_1

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c  python  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g  python  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no

 ## 18. Count the number of each type of animal in df.

In [276]:
df_1.groupby('animal').animal.count()

animal
cat       4
dog       4
python    2
Name: animal, dtype: int64

## 19. . The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False

In [277]:
df_1['priority'] = df_1.apply(lambda x: "True" if x['priority'] == "yes" else "False", axis = 1)

In [278]:
df_1

   animal  age  visits priority
a     cat  2.5       1     True
b     cat  3.0       3     True
c  python  0.5       2    False
d     dog  NaN       3     True
e     dog  5.0       2    False
f     cat  2.0       3    False
g  python  4.5       1    False
h     cat  NaN       1     True
i     dog  7.0       2    False
j     dog  3.0       1    False

## 20. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [284]:
df_1.pivot_table(columns=['animal','visits'])

     animal  visits
age  cat     1         2.5
             3         2.5
     dog     1         3.0
             2         6.0
     python  1         4.5
             2         0.5
dtype: float64

In [285]:
df_1.pivot_table(columns=['animal','visits']).age.mean()

3.1666666666666665